[
        {
            "DuaNo": "1",
            "ArabicText": " رَبَّنَا تَقَبَّلْ مِنَّآ ۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلْعَلِيمُ ",
            "EngText": "Rabbana taqabbal minna innaka antas Sameeaul Aleem",
            "EngTranslation": "O Lord, accept this service from us; You are All-Hearing and All-Knowing",
            "UrduTranslation": "اے رب  ہم سے یہ خدمت قبول فرما۔ بےشک تو سننے والا اور جاننے والا ہے",
            "Ref": "(2:127)",
            "SurahName": "البقرة"
        },
        {
            "DuaNo": "2",
            "ArabicText": "رَبَّنَا وَٱجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَآ أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَآ ۖ إِنَّكَ أَنتَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
            "EngText": "Rabbana wa-j'alna Muslimaini laka wa min Dhurriyatina 'Ummatan Muslimatan laka wa 'Arina Manasikana wa tub 'alaina 'innaka 'antat-Tawwabu-Raheem",
            "EngTranslation": "O Lord, make us Your Muslims (submissive servants) and also raise from our offspring a community which should be Muslim (submissive to Your Will). Show us the ways of Your worship and forbear our shortcomings: You are Forgiving and Merciful.",
            "UrduTranslation": " اے رب  ہم کو اپنا فرمانبردار بنائے رکھیو۔ اور ہماری اولاد میں سے بھی ایک گروہ کو اپنا مطیع بنائے رہیو اور رب  ہمیں طریق عبادت بتا اور ہمارے حال پر رحم کے ساتھ توجہ فرما۔ بے شک تو توجہ فرمانے والا مہربان ہے",
            "Ref": "(2:128)",
            "SurahName": "البقرة"
        },
        {
            "DuaNo": "3",
            "ArabicText": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
            "EngText": "Rabbana atina fid-dunya hasanatan wa fil 'akhirati hasanatan waqina 'adhaban-nar",
            "EngTranslation": "O Lord, give us what is good in this world and also what is good in the Hereafter and save us from the torment of Fire",
            "UrduTranslation": " اے رب  ہم کو دنیا میں بھی نعمت عطا فرما اور اخرت میں بھی نعمت بخشیو اور دوزخ کے عذاب سے محفوظ رکھیو",
            "Ref": "(2:201)",
            "SurahName": "البقرة"
        },
        {
            "DuaNo": "4",
            "ArabicText": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْراً وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى القَوْمِ الكَافِرِينَ",
            "EngText": "Rabbana afrigh 'alaina sabran wa thabbit aqdamana wansurna 'alal-qawmil-kafirin",
            "EngTranslation": "O Lord pour upon us patience and plant firmly our feet and give us victory over the disbelieving people",
            "UrduTranslation": "اے رب  ہم پر صبر کے دہانے کھول دے اور ہمیں لڑائی میں ثابت قدم رکھ اور لشکر کفار پر فتحیاب کر",
            "Ref": "(2/250)",
            "SurahName": "البقرة"
        },
        {
            "DuaNo": "5",
            "ArabicText": "رَبَّنَا لَا تُؤَاخِذْنَآ     إِن نَّسِينَآ أَوْ أَخْطَأْنَا ۚ ",
            "EngText": "Rabbana la tu'akhidhna in-nasina aw akhta'na",
            "EngTranslation": "O Lord do not impose blame upon us if we have forgotten or erred",
            "UrduTranslation": "اے رب  اگر ہم سے بھول یا چوک ہوگئی ہو تو ہم سے مواخذہ نہ کیجیو۔ ",
            "Ref": "(2/ 286)",
            "SurahName": "البقرة"
        },
        {
            "DuaNo": "6",
            "ArabicText": "رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَآ إِصْرًا كَمَا حَمَلْتَهُۥ عَلَى ٱلَّذِينَ مِن قَبْلِنَا ۚ ",
            "EngText": "Rabbana wala tahmil alaina isran kama hamaltahu 'alal-ladheena min qablina",
            "EngTranslation": "Our Lord! and lay not upon us a burden like that which You laid upon those before us",
            "UrduTranslation": "اے رب  ہم پر ایسا بوجھ نہ ڈالیو جیسا تو نے ہم سے پہلے لوگوں پر ڈالا تھا۔ ",
            "Ref": "(2/ 286)",
            "SurahName": "البقرة"
        },
        {
            "DuaNo": "7",
            "ArabicText": "رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِۦ ۖ وَٱعْفُ عَنَّا وَٱغْفِرْ لَنَا وَٱرْحَمْنَآ ۚ أَنتَ مَوْلَىٰنَا فَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَٰفِرِينَ  ",
            "EngText": "Rabbana wala tuhammilna ma la taqata lana bihi wa'fu anna waghfir lana wairhamna anta mawlana fansurna 'alal-qawmil kafireen",
            "EngTranslation": "Our Lord!  and burden us not with that which we have no ability to bear And pardon us; and forgive us; and have mercy upon us You are our protector so give us victory over the disbelieving people",
            "UrduTranslation": "اے رب  جتنا بوجھ اٹھانے کی ہم میں طاقت نہیں اتنا ہمارے سر پر نہ رکھیو۔ اور اے رب  ہمارے گناہوں سے درگزر کر اور ہمیں بخش دے۔ اور ہم پر رحم فرما۔ تو ہی ہمارا مالک ہے اور ہم کو کافروں پر غالب فرما",
            "Ref": "(2/ 286)",
            "SurahName": "البقرة"
        },
        {
            "DuaNo": "8",
            "ArabicText": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ الْوَهَّابُ",
            "EngText": "Rabbana la tuzigh quloobana ba'da idh hadaitana wa hab lana milladunka rahmah innaka antal Wahhab",
            "EngTranslation": "O Lord! Do not let our hearts swerve towards crookedness after You have guided us to the right way, and. bestow upon us Your mercy. Surely You, only You, are the Munificent Giver",
            "UrduTranslation": " اے رب  جب تو نے ہمیں ہدایت بخشی ہے تو اس کے بعد ہمارے دلوں میں کجی نہ پیدا کر دیجیو اور ہمیں اپنے ہاں سے نعمت عطا فرما تو تو بڑا عطا فرمانے والا ہے",
            "Ref": "(3/ 8)",
            "SurahName": "آل عمران"
        },
        {
            "DuaNo": "9",
            "ArabicText": "رَبَّنَا إِنَّكَ جَامِعُ النَّاسِ لِيَوْمٍ لاَّ رَيْبَ فِيهِ إِنَّ اللّهَ لاَ يُخْلِفُ الْمِيعَادَ",
            "EngText": "Rabbana innaka jami'unnasi li-Yawmil la raiba fi innallaha la yukhliful mi'aad",
            "EngTranslation": "Our Lord! Thou art He that will gather mankind Together against a day about which there is no doubt; for Allah never fails in His promise.",
            "Ref": "(3/ 9)",
            "SurahName": "آل عمران"
        },
        {
            "DuaNo": "10",
            "ArabicText": "رَبَّنَآ إِنَّنَآ ءَامَنَّا      فَٱغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ ٱلنَّارِ",
            "EngText": "Rabbana innana amanna faghfir lana dhunuubana wa qinna 'adhaban-Naar",
            "EngTranslation": "O Lord! We do indeed believe, so forgive us our sins and keep us safe from the chastisement of the Fire",
            "UrduTranslation": "اے رب  ہم ایمان لے ائے سو ہم کو ہمارے گناہ معاف فرما اور دوزخ کے عذاب سے محفوظ رکھ",
            "Ref": "(3/ 16)",
            "SurahName": "آل عمران"
        },
        {
            "DuaNo": "11",
            "ArabicText": "رَبَّنَآ ءَامَنَّا بِمَآ أَنزَلْتَ وَٱتَّبَعْنَا ٱلرَّسُولَ فَٱكْتُبْنَا مَعَ ٱلشَّٰهِدِينَ",
            "EngText": "Rabbana amanna bima anzalta wattaba 'nar-Rusula fak-tubna ma'ash-Shahideen",
            "EngTranslation": "Our Lord! We believe in what Thou hast revealed, and we follow the Messenger. Then write us down among those who bear witness",
            "Ref": "(3/153)",
            "SurahName": "آل عمران"
        },
        {
            "DuaNo": "12",
            "ArabicText": "رَبَّنَا ٱغْفِرْ لَنَا ذُنُوبَنَا وَإِسْرَافَنَا فِىٓ أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَٱنصُرْنَا عَلَى ٱلْقَوْمِ ٱلْكَٰفِرِينَ",
            "EngText": "Rabbana-ghfir lana dhunuubana wa israfana fi amrina wa thabbit aqdamana wansurna 'alal qawmil kafireen",
            "EngTranslation": "Our Lord! forgive us for our sins and wasted efforts, make our foothold sure, and give us victory over the disbeleivers",
            "UrduTranslation": "اے رب  ہمارے گناہ اور زیادتیاں جو ہم اپنے کاموں میں کرتے رہے ہیں معاف فرما اور ہم کو ثابت قدم رکھ اور کافروں پر فتح عنایت فرما",
            "Ref": "(3:147)",
            "SurahName": "آل عمران"
        },
        {
            "DuaNo": "13",
            "ArabicText": "رَبَّنَا مَا خَلَقْتَ هَٰذَا بَٰطِلًا سُبْحَٰنَكَ فَقِنَا عَذَابَ ٱلنَّارِ  ",
            "EngText": "Rabbana ma khalaqta hadha batila Subhanaka faqina 'adhaban-Naar",
            "EngTranslation": "Our Lord! You did not create this aimlessly; exalted are You [above such a thing]; then protect us from the punishment of the Fire",
            "UrduTranslation": "اے رب  تو نے اس مخلوق کو بے فائدہ نہیں پیدا کیا تو پاک ہے تو قیامت کے دن ہمیں دوزخ کے عذاب سے بچائیو",
            "Ref": "(3:191)",
            "SurahName": "آل عمران"
        },
        {
            "DuaNo": "14",
            "ArabicText": " رَبَّنَآ إِنَّكَ مَن تُدْخِلِ ٱلنَّارَ فَقَدْ أَخْزَيْتَهُۥ ۖ وَمَا لِلظَّٰلِمِينَ مِنْ أَنصَارٍۢ",
            "EngText": "Rabbana innaka man tudkhilin nara faqad akhzaytah wa ma liDh-dhalimeena min ansar",
            "EngTranslation": "Our Lord! Whomever You cause to enter the Fire, him You indeed bring to disgrace, and there will be none to succour the wrong-doers.",
            "UrduTranslation": "اے رب  جس کو تو نے دوزخ میں ڈالا اسے رسوا کیا اور ظالموں کا کوئی مددگار نہیں",
            "Ref": "(3:192)",
            "SurahName": "آل عمران"
        },
        {
            "DuaNo": "15",
            "ArabicText": "رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِيًا يُنَادِي لِلْإِيمَانِ أَنْ آمِنُوا بِرَبِّكُمْ فَآمَنَّا ۚ ",
            "EngText": "Rabbana innana sami'na munadiyany-yunadi lil-imani an aminu bi Rabbikum fa'aamanna",
            "EngTranslation": "Our Lord! Indeed we heard a crier calling to the faith saying: \"Believe in your Lord\"; so we did believe. ",
            "UrduTranslation": " اے رب  ہم نے ایک ندا کرنے والے کو سنا کہ ایمان کے لیے پکار رہا تھا یعنی اپنے رب  پر ایمان لاو تو ہم ایمان لے ائے ",
            "Ref": "(3:193)",
            "SurahName": "آل عمران"
        },
        {
            "DuaNo": "16",
            "ArabicText": "رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الْأَبْرَارِ",
            "EngText": "Rabbana faghfir lana dhunoobana wa kaffir 'ana saiyi'aatina wa tawaffana ma'al Abrar",
            "EngTranslation": "* Our Lord, forgive us our sins, and wipe out our evil deeds and make us die with the truly pious.'",
            "UrduTranslation": "اے رب  ہمارے گناہ معاف فرما اور ہماری برائیوں کو ہم سے محو کر اور ہم کو دنیا سے نیک بندوں کے ساتھ اٹھا",
            "Ref": "(3:193)",
            "SurahName": "آل عمران"
        },
        {
            "DuaNo": "17",
            "ArabicText": " رَبَّنَا وَءَاتِنَا مَا وَعَدتَّنَا عَلَىٰ رُسُلِكَ وَلَا تُخْزِنَا يَوْمَ ٱلْقِيَٰمَةِ ۗ إِنَّكَ لَا تُخْلِفُ ٱلْمِيعَادَ",
            "EngText": "Rabbana wa 'atina ma wa'adtana 'ala rusulika wa la tukhzina yawmal-Qiyamah innaka la tukhliful mi'aad",
            "EngTranslation": "Our Lord! and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection Indeed You do not fail in [Your] promise\"",
            "UrduTranslation": "اے رب  تو نے جن جن چیزوں کے ہم سے اپنے پیغمبروں کے ذریعے سے وعدے کیے ہیں وہ ہمیں عطا فرما اور قیامت کے دن ہمیں رسوا نہ کیجو کچھ شک نہیں کہ تو خلاف وعدہ نہیں کرتا",
            "Ref": "(3:194)",
            "SurahName": "آل عمران"
        },
        {
            "DuaNo": "18",
            "ArabicText": "رَبَّنَا آمَنَّا فَاكْتُبْنَا مَعَ الشَّاهِدِينَ",
            "EngText": "Rabbana aamana faktubna ma' ash-shahideen",
            "EngTranslation": "Our Lord! We believe; write us down among the witnesses",
            "Ref": "(5/83)",
            "SurahName": "ٱلْمَائِدَة"
        },
        {
            "DuaNo": "19",
            "ArabicText": "رَبَّنَا أَنزِلْ عَلَيْنَا مَآئِدَةً مِّنَ السَّمَاء تَكُونُ لَنَا عِيداً لِّأَوَّلِنَا وَآخِرِنَا وَآيَةً مِّنكَ وَارْزُقْنَا وَأَنتَ خَيْرُ الرَّازِقِينَ",
            "EngText": "Rabbana anzil 'alaina ma'idatam minas-Samai tuknu lana 'idal li-awwa-lina wa aakhirna wa ayatam-minka war-zuqna wa anta Khayrul-Raziqeen",
            "EngTranslation": "O Allah our Lord! Send us from heaven a table set (with viands), that there may be for us - for the first and the last of us - a solemn festival and a sign from you and provide for our sustenance, for you are the best Sustainer (of our needs)",
            "Ref": "(5/114)",
            "SurahName": "ٱلْمَائِدَة"
        },
        {
            "DuaNo": "20",
            "ArabicText": "رَبَّنَا ظَلَمْنَآ أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ ٱلْخَٰسِرِينَ",
            "EngText": "Rabbana zalamna anfusina wa il lam taghfir lana wa tarhamna lana kunan minal-khasireen",
            "EngTranslation": "Our Lord! We have wronged ourselves. If You do not forgive us and do not have mercy on us, we shall surely be among the losers.",
            "UrduTranslation": " اے رب  ہم نے اپنی جانوں پر ظلم کیا اور اگر تو ہمیں نہیں بخشے گا اور ہم پر رحم نہیں کرے گا تو ہم تباہ ہو جائیں گے",
            "Ref": "(7:23)",
            "SurahName": "الأعراف"
        },
        {
            "DuaNo": "21",
            "ArabicText": "رَبَّنَا لاَ تَجْعَلْنَا مَعَ الْقَوْمِ الظَّالِمِينَ",
            "EngText": "Rabbana la taj'alna ma'al qawwmi-dhalimeen",
            "EngTranslation": "Our Lord! Send us not to the company of the wrong-doers ",
            "Ref": "(7/47)",
            "SurahName": "الأعراف"
        },
        {
            "DuaNo": "22",
            "ArabicText": "رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ",
            "EngText": "Rabbanaf-tah bainana wa baina qawmina bil haqqi wa anta Khairul Fatiheen",
            "EngTranslation": "Our Lord! Decide  between us and our people in truth,  You are the best to decide",
            "Ref": "(7/89)",
            "SurahName": "الأعراف"
        },
        {
            "DuaNo": "23",
            "ArabicText": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَتَوَفَّنَا مُسْلِمِينَ",
            "EngText": "Rabbana afrigh 'alaina sabraw wa tawaffana Muslimeen",
            "EngTranslation": "Our Lord! Pour out on us patience and constancy, and take our souls unto thee as Muslims (who bow to thy will) ",
            "Ref": "(7/126)",
            "SurahName": "الأعراف"
        },
        {
            "DuaNo": "24",
            "ArabicText": "رَبَّنَا لاَ تَجْعَلْنَا فِتْنَةً لِّلْقَوْمِ الظَّالِمِينَ   وَنَجِّنَا بِرَحْمَتِكَ مِنَ الْقَوْمِ الْكَافِرِينَ",
            "EngText": "Rabbana la taj'alna fitnatal lil-qawmidh-Dhalimeen wa najjina bi-Rahmatika minal qawmil kafireen",
            "EngTranslation": "Our Lord! Make us not a trial for those who practise oppression; And deliver us by Thy Mercy from those who reject (Thee)",
            "Ref": "(10/85-86)",
            "SurahName": "يُونُس"
        },
        {
            "DuaNo": "25",
            "ArabicText": "رَبَّنَا إِنَّكَ تَعْلَمُ مَا نُخْفِي وَمَا نُعْلِنُ وَمَا يَخْفَى عَلَى اللّهِ مِن   شَيْءٍ فَي الأَرْضِ وَلاَ فِي السَّمَاء",
            "EngText": "Rabbana innaka ta'lamu ma nukhfi wa ma nu'lin wa ma yakhfa 'alal-lahi min shai'in fil-ardi wa la fis-Sama'",
            "EngTranslation": "O our Lord! Truly Thou dost know what we conceal and what we reveal: for nothing whatever is hidden from Allah, whether on earth or in heaven",
            "Ref": "(14/38)",
            "SurahName": "إِبْرَاهِيم"
        },
        {
            "DuaNo": "26",
            "ArabicText": "رَبَّنَا وَتَقَبَّلْ دُعَاء",
            "EngText": "Rabbana wa taqabbal Du'a",
            "EngTranslation": "O our Lord! And accept my Prayer",
            "Ref": "(14/40)",
            "SurahName": "إِبْرَاهِيم"
        },
        {
            "DuaNo": "27",
            "ArabicText": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
            "EngText": "Rabbana ghfir li wa li wallidayya wa lil Mu'mineena yawma yaqumul hisaab",
            "EngTranslation": "O our Lord! Cover (us) with Thy Forgiveness - me, my parents, and (all) Believers, on the Day that the Reckoning will be established! ",
            "Ref": "(14/41)",
            "SurahName": "إِبْرَاهِيم"
        },
        {
            "DuaNo": "28",
            "ArabicText": "رَبَّنَا آتِنَا مِن لَّدُنكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا",
            "EngText": "Rabbana 'atina mil-ladunka Rahmataw wa haiyi lana min amrina rashada",
            "EngTranslation": "Our Lord! Bestow on us Mercy from Thyself, and dispose of our affair for us in the right way! ",
            "Ref": "(18/10)",
            "SurahName": "ٱلْكَهْف"
        },
        {
            "DuaNo": "29",
            "ArabicText": "رَبَّنَا إِنَّنَا نَخَافُ أَن يَفْرُطَ عَلَيْنَا أَوْ أَن يَطْغَى",
            "EngText": "Rabbana innana nakhafu ai-yafruta 'alaina aw any-yatgha",
            "EngTranslation": "Our Lord! We fear lest he hasten with insolence against us, or lest he transgress all bounds",
            "Ref": "(20/45)",
            "SurahName": "طه"
        },
        {
            "DuaNo": "30",
            "ArabicText": "رَبَّنَا آمَنَّا فَاغْفِرْ لَنَا وَارْحَمْنَا وَأَنتَ خَيْرُ الرَّاحِمِينَ",
            "EngText": "Rabbana amanna faghfir lana warhamna wa anta khairur Rahimiin",
            "EngTranslation": "Our Lord! We believe; then do Thou forgive us, and have mercy upon us: For Thou art the Best of those who show mercy",
            "Ref": "(23/109)",
            "SurahName": "ٱلْمُؤْمِنُون"
        },
        {
            "DuaNo": "31",
            "ArabicText": "رَبَّنَا اصْرِفْ عَنَّا عَذَابَ جَهَنَّمَ إِنَّ عَذَابَهَا كَانَ غَرَامًا إِنَّهَا سَاءتْ مُسْتَقَرًّا وَمُقَامًا",
            "EngText": "Rabbanas-rif 'anna 'adhaba jahannama inna 'adhabaha kana gharama innaha sa'at musta-qarranw wa muqama",
            "EngTranslation": "Our Lord! Avert from us the Wrath of Hell, for its Wrath is indeed an affliction grievous,- Evil indeed is it as an abode, and as a place to rest in ",
            "Ref": "(25/65-66)",
            "SurahName": "ٱلْفُرْقَان"
        },
        {
            "DuaNo": "32",
            "ArabicText": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
            "EngText": "Rabbana Hablana min azwaajina wadhurriy-yatina, qurrata 'ayioni wa-jalna lil-muttaqeena Imaama",
            "EngTranslation": "O my Lord! Grant unto us wives and offspring who will be the comfort of our eyes, and give us (the grace) to lead the righteous",
            "Ref": "(25/75)",
            "SurahName": "ٱلْفُرْقَان"
        },
        {
            "DuaNo": "33",
            "ArabicText": "رَبَّنَا لَغَفُورٌ شَكُورٌ",
            "EngText": "Rabbana la Ghafurun shakur",
            "EngTranslation": "Our Lord is indeed Oft-Forgiving Ready to appreciate (service)",
            "Ref": "(35/34)",
            "SurahName": "فَاطِر"
        },
        {
            "DuaNo": "34",
            "ArabicText": "رَبَّنَا وَسِعْتَ كُلَّ   شَيْءٍ رَّحْمَةً وَعِلْمًا فَاغْفِرْ لِلَّذِينَ تَابُوا وَاتَّبَعُوا سَبِيلَكَ وَقِهِمْ عَذَابَ الْجَحِيمِ",
            "EngText": "Rabbana wasi'ta kulla sha'ir Rahmatanw wa 'ilman faghfir lilladhina tabu wattaba'u sabilaka waqihim 'adhabal-Jahiim",
            "EngTranslation": "Our Lord! Thy Reach is over all things, in Mercy and Knowledge. Forgive, then, those who turn in Repentance, and follow Thy Path; and preserve them from the Penalty of the Blazing Fire!",
            "Ref": "(40/7)",
            "SurahName": "غَافِر"
        },
        {
            "DuaNo": "35",
            "ArabicText": "رَبَّنَا وَأَدْخِلْهُمْ جَنَّاتِ عَدْنٍ الَّتِي وَعَدتَّهُم وَمَن صَلَحَ مِنْ آبَائِهِمْ وَأَزْوَاجِهِمْ وَذُرِّيَّاتِهِمْ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ وَقِهِمُ السَّيِّئَاتِ وَمَن تَقِ السَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَهُ وَذَلِكَ هُوَ الْفَوْزُ الْعَظِيمُ",
            "EngText": "Rabbana wa adhkhilhum Jannati 'adninil-lati wa'attahum wa man salaha min aba'ihim wa azwajihim wa dhuriyyatihim innaka antal 'Azizul-Hakim, waqihimus saiyi'at wa man taqis-saiyi'ati yawma'idhin faqad rahimatahu wa dhalika huwal fawzul-'Adheem",
            "EngTranslation": "Our Lord! that they enter the Gardens of Eternity, which Thou hast promised to them, and to the righteous among their fathers, their wives, and their posterity! For Thou art (He), the Exalted in Might, Full of Wisdom. And preserve them from (all) ills; and any whom Thou dost preserve from ills that Day,- on them wilt Thou have bestowed Mercy indeed: and that will be truly (for them) the highest Achievement",
            "Ref": "(40/8-9)",
            "SurahName": "غَافِر"
        },
        {
            "DuaNo": "36",
            "ArabicText": "رَبَّنَا اغْفِرْ لَنَا وَلِإِخْوَانِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَانِ وَلَا تَجْعَلْ فِي قُلُوبِنَا غِلًّا لِّلَّذِينَ آمَنُوا",
            "EngText": "Rabbana-ghfir lana wa li 'ikhwani nalladhina sabaquna bil imani wa la taj'al fi qulubina ghillal-lilladhina amanu",
            "EngTranslation": "Our Lord! Forgive us, and our brethren who came before us into the Faith, and leave not, in our hearts, rancour (or sense of injury) against those who have believed",
            "Ref": "(59/10)",
            "SurahName": "ٱلْحَشْر"
        },
        {
            "DuaNo": "37",
            "ArabicText": "رَبَّنَا إِنَّكَ رَؤُوفٌ رَّحِيمٌ",
            "EngText": "Rabbana innaka Ra'ufur Rahim",
            "EngTranslation": "Our Lord! Thou art indeed Full of Kindness, Most Merciful",
            "Ref": "(59/10)",
            "SurahName": "ٱلْحَشْر"
        },
        {
            "DuaNo": "38",
            "ArabicText": "رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِيرُ",
            "EngText": "Rabbana 'alaika tawakkalna wa-ilaika anabna wa-ilaikal masir",
            "EngTranslation": "Our Lord! In Thee do we trust, and to Thee do we turn in repentance: to Thee is (our) Final Goal",
            "Ref": "(60/4)",
            "SurahName": "ٱلْمُمْتَحَنَة"
        },
        {
            "DuaNo": "39",
            "ArabicText": "رَبَّنَا لَا تَجْعَلْنَا فِتْنَةً لِّلَّذِينَ كَفَرُوا    وَاغْفِرْ لَنَا رَبَّنَا إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ",
            "EngText": "Rabbana la taj'alna fitnatal lilladhina kafaru waghfir lana Rabbana innaka antal 'Azizul-Hakim",
            "EngTranslation": "Our Lord! Make us not a (test and) trial for the Unbelievers, but forgive us, our Lord! for Thou art the Exalted in Might, the Wise",
            "Ref": "(60/5)",
            "SurahName": "ٱلْمُمْتَحَنَة"
        },
        {
            "DuaNo": "40",
            "ArabicText": "رَبَّنَا أَتْمِمْ لَنَا نُورَنَا وَاغْفِرْ لَنَا إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ",
            "EngText": "Rabbana atmim lana nurana waighfir lana innaka 'ala kulli shai-in qadir",
            "EngTranslation": "Our Lord! Perfect our Light for us, and grant us Forgiveness: for Thou hast power over all things",
            "Ref": "(66/8)",
            "SurahName": "ٱلطَّلَاق"
        },
        {
            "DuaNo": "41",
            "ArabicText": "رَبِّ هَبْ لِى مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ ٱلدُّعَآءِ",
            "EngText": "Rabbi hablee Milladunka zurriyattan tayyibattan innaka sameeudduaa",
            "EngTranslation": "O Lord! Grant me from Yourself out of Your grace the gift of a goodly offspring, for indeed You alone heed all Prayers",
            "UrduTranslation": "اےرب  مجھے اپنی جناب سے اولاد صالح عطا فرما تو بے شک دعا سننے اور قبول کرنے والا ہے",
            "Ref": "(3/147)",
            "SurahName": "آل عمران"
        },
        {
            "DuaNo": "42",
            "ArabicText": "رَبِّ إِنّى أَعوذُ بِكَ أَن أَسـَٔلَكَ ما لَيسَ لى بِهِ عِلمٌ ۖ وَإِلّا تَغفِر لى وَتَرحَمنى أَكُن مِنَ الخٰسِرينَ",
            "EngText": "Rabbi innee aoothu bika an asalaka ma laysa lee bihi ilmun wailla taghfir lee watarhamnee akun mina alkhasireen",
            "EngTranslation": "My Lord, I seek refuge with You from asking You of that which I have no knowledge. If You do not forgive me and have mercy on me, I shall be among the losers.'",
            "Ref": "(11/47)",
            "SurahName": "هُود"
        },
        {
            "DuaNo": "43",
            "ArabicText": "رَبِّ فاطِرَ السَّمٰوٰتِ وَالأَرضِ أَنتَ وَلِيّۦ فِى الدُّنيا وَالءاخِرَةِ ۖ تَوَفَّنى مُسلِمًا وَأَلحِقنى بِالصّٰلِحينَ",
            "EngText": "Rabbi fatira alssamawati waalardi anta waliyyee fee alddunya waalakhirati tawaffanee musliman waalhiqnee bialssaliheen",
            "EngTranslation": "My Lord! Originator of the heavens and the earth! Thou art my guardian in this world and the hereafter; make me die a muslim and join me with the good.",
            "Ref": "(12/101)",
            "SurahName": "يُوسُف"
        },
        {
            "DuaNo": "44",
            "ArabicText": " رَبِّ السِّجنُ أَحَبُّ إِلَىَّ مِمّا يَدعونَنى إِلَيهِ ۖ وَإِلّا تَصرِف عَنّى كَيدَهُنَّ أَصبُ إِلَيهِنَّ وَأَكُن مِنَ الجٰهِلينَ",
            "EngText": "Rabbi alssijnu ahabbu ilayya mimma yadoonanee ilayhi wailla tasrif annee kaydahunna asbu ilayhinna waakun mina aljahileen",
            "EngTranslation": "My Lord! the prison house is dearer to me than that to which they invite me;and if Thou turn not away their device from me, I will yearn towards them and become (one) of the ignorant.",
            "Ref": "(12/33)",
            "SurahName": "يُوسُف"
        },
        {
            "DuaNo": "45",
            "ArabicText": "رَبِّ اجعَلنى مُقيمَ الصَّلوٰةِ وَمِن ذُرِّيَّتى ۚ رَبَّنا وَتَقَبَّل دُعاءِ ",
            "EngText": "Rabbi ijalnee muqeemas salati wamin zurriyyatee rabbana wtaqabbal dua",
            "EngTranslation": "O my Lord ! make me one who establishes regular prayer and (also) from my offspring ,our Lord! and accept my invocation",
            "Ref": "(14/40)",
            "SurahName": "إِبْرَاهِيم"
        },
        {
            "DuaNo": "46",
            "ArabicText": "رَبِّ ٱشْرَحْ لِى صَدْرِى وَيَسِّرْ لِي أَمْرِي وَاحْلُلْ عُقْدَةً مِنْ لِسَانِي يَفْقَهُوا قَوْلِي",
            "EngText": "Rabbi Sharli Sadri Wa Yassirli Amri Wahlul Uqdatan Mil-Lisaani Yafqahu Qawli”",
            "EngTranslation": "My Lord, expand for me my breast [with assurance] and ease for me my task and untie the knot from my tongue that they may understand my speech.",
            "UrduTranslation": "  اے رب  اس کام کے لئے میرا سینہ کھول دے  اور میرا کام اسان کردے اور میری زبان کی گرہ کھول دے تاکہ وہ بات سمجھ لیں",
            "Ref": "(20/25-28)",
            "SurahName": "طه"
        },
        {
            "DuaNo": "47",
            "ArabicText": "رَّبِّ زِدْنِى عِلْمًا",
            "EngText": "Rabbi Zidni 'ilma",
            "EngTranslation": "O Lord! Increase Me In My Knowledge\".",
            "UrduTranslation": " اے رب  مجھے اور زیادہ علم دے",
            "Ref": "(20/114)",
            "SurahName": "طه"
        },
        {
            "DuaNo": "48",
            "ArabicText": "أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ",
            "EngText": "Anni massani-yadh-dhurru wa ‘anta arhamur-Raahimeen",
            "EngTranslation": "Indeed, distress has touched me, and You are the most Merciful of the merciful ones",
            "UrduTranslation": " ( اے رب )  مجھے ایذا ہو رہی ہے اور تو سب سے بڑھ کر رحم کرنے والا ہے",
            "Ref": "(21/83)",
            "SurahName": "ٱلْأَنْبِيَاء"
        },
        {
            "DuaNo": "49",
            "ArabicText": "لَّآ إِلَٰهَ إِلَّآ أَنتَ سُبْحَٰنَكَ إِنِّى كُنتُ مِنَ ٱلظَّٰلِمِينَ",
            "EngText": "La ilaha illa anta subhanaka inni kuntu minaz-zalimin",
            "EngTranslation": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers",
            "UrduTranslation": " ( اے رب ) تیرے سوا کوئی معبود نہیں۔ تو پاک ہے اور بےشک میں قصوروار ہوں",
            "Ref": "(21/87)",
            "SurahName": "ٱلْأَنْبِيَاء"
        },
        {
            "DuaNo": "50",
            "ArabicText": "رَبِّ لَا تَذَرْنِیْ فَرْدًا وَّ اَنْتَ خَيْرُالْوٰرِثِيْنَ",
            "EngText": "Rabbi la tazarni fardanw wa anta khair ul wariseen",
            "EngTranslation": "O Lord!, do not leave me alone [with no heir], while you are the best of inheritors",
            "UrduTranslation": "  اے رب  مجھے اکیلا نہ چھوڑ اور تو سب سے بہتر وارث ہے",
            "Ref": "(21/89)",
            "SurahName": "ٱلْأَنْبِيَاء"
        },
        {
            "DuaNo": "51",
            "ArabicText": "رَبِّ أَنْزِلْنِىْ مُنْزَلا مُّبَارَكًا وَّ َأَنْتَ خَيْرُ الْمُنْزِلِينَ",
            "EngText": "Rabbi anzilnee munzalan mubarakan waanta khayru almunzileen",
            "EngTranslation": "My Lord! Let me land at a blessed landing place, and You are the best to accommodate",
            "UrduTranslation": "اے میرے رب ! مجھے برکت والی جگہ اتار اور تو بہترین جگہ اتارنے والا ہے۔",
            "Ref": "(23/29)",
            "SurahName": "ٱلْمُؤْمِنُون"
        },
        {
            "DuaNo": "52",
            "ArabicText": "رَبِّ فَلَا تَجْعَلْنِي فِي الْقَوْمِ الظَّالِمِينَ",
            "EngText": "Rabbi fala tajalnee feelqawmi thalimeen",
            "EngTranslation": "My Lord, then do not place me among the wrongdoing people.\"",
            "Ref": "(23/94)",
            "SurahName": "ٱلْمُؤْمِنُون"
        },
        {
            "DuaNo": "53",
            "ArabicText": "رَبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَعُوذُ بِكَ رَبِّ اَنْ يَّحْضُرُونِ",
            "EngText": "Rabbi aaoozubika min hamazaatish shayaateeni wa aaoozubika rabbi an yahzuroon\r\n",
            "EngTranslation": "My Lord! I seek refuge in You from the incitements of the devils, And I seek refuge in You, my Lord , lest they be present with me",
            "UrduTranslation": "اے میرے رب! میں شیطانوں کے وسوسوں سے تیری پناہ چاہتا ہوں ۔ اور اے رب! میں تیری پناہ چاہتا ہوں کہ وہ میرے پاس آجائیں۔",
            "Ref": "(23/97-98)",
            "SurahName": "ٱلْمُؤْمِنُون"
        },
        {
            "DuaNo": "54",
            "ArabicText": "رَبِّ اغفِر وَارحَم وَأَنتَ خَيرُ الرّٰحِمينَ",
            "EngText": "Rabbi ighfir warham wa anta khayrur raahimeen",
            "EngTranslation": "O Lord ! forgive and have mercy and You are the best of the Merciful ones",
            "Ref": "(23/118)",
            "SurahName": "ٱلْمُؤْمِنُون"
        },
        {
            "DuaNo": "55",
            "ArabicText": "رَبِّ أَوزِعنى أَن أَشكُرَ نِعمَتَكَ الَّتى أَنعَمتَ عَلَىَّ وَعَلىٰ وٰلِدَىَّ وَأَن أَعمَلَ صٰلِحًا تَرضىٰهُ وَأَدخِلنى بِرَحمَتِكَ فى عِبادِكَ الصّٰلِحينَ",
            "EngText": "Rabbi awziAAnee an ashkura niaamataka allatee anamta alayya wa alaa waalidayya wa an amala saalihan tarzahu wa adkhilnee birahmatika fee ibaadikas saaliheen   ",
            "EngTranslation": "My Lord ! grant me that I should be grateful for Your  favor which You hast bestowed on me and on my parents and that I should do good such as You are pleased with and make me enter by Your mercy,into Your servants ,the good ones",
            "Ref": "(27/19)",
            "SurahName": "ٱلنَّمْل"
        },
        {
            "DuaNo": "56",
            "ArabicText": "رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي",
            "EngText": "Rabbi innee zalamtu nafsee faghfirli",
            "EngTranslation": "O Lord! surely I have wronged myself , forgive me",
            "Ref": "(28/16)",
            "SurahName": "ٱلْقَصَص"
        },
        {
            "DuaNo": "57",
            "ArabicText": "رَبِّ نَجِّنى مِنَ القَومِ الظّٰلِمينَ",
            "EngText": "Rabbi najjinee mina alqawmi alththalimeen",
            "EngTranslation": "O Lord! deliver me from the unjust people",
            "Ref": "(28/21)",
            "SurahName": "ٱلْقَصَص"
        },
        {
            "DuaNo": "58",
            "ArabicText": "رَبِّ إِنّى لِما أَنزَلتَ إِلَىَّ مِن خَيرٍ فَقيرٌ",
            "EngText": "Rabbi innee limaa anzalta ilayya min khayrin faqeer",
            "EngTranslation": "O my Lord ! Truly I am in need of whatever good You bestow on me",
            "Ref": "(28/24)",
            "SurahName": "ٱلْقَصَص"
        },
        {
            "DuaNo": "59",
            "ArabicText": "رَبِّ انصُرنى عَلَى القَومِ المُفسِدينَ",
            "EngText": "Rabbin surnee alal qawmil mufsideen",
            "EngTranslation": "My Lord ! help me against the mischievous people",
            "Ref": "(29/30)",
            "SurahName": "ٱلْعَنْكَبُوت"
        },
        {
            "DuaNo": "60",
            "ArabicText": "رَبِّ هَبْ لِى مِنَ ٱلصَّـٰلِحِينَ",
            "EngText": "Rabbi hab lee minassaaliheen ",
            "EngTranslation": "My Lord ! grant me (offspring) from the righteous ",
            "Ref": "(37/100)",
            "SurahName": "ٱلصَّافَّات"
        },
        {
            "DuaNo": "61",
            "ArabicText": "رَبِّ هَب لى حُكمًا وَأَلحِقنى بِالصّٰلِحينَ",
            "EngText": "Rabbi hab lee hukman waalhiqnee bialssaliheen",
            "EngTranslation": "My Lord,Grant me wisdom, and join me with the good",
            "Ref": "(42/83)",
            "SurahName": "ٱلشُّورىٰ"
        },
        {
            "DuaNo": "62",
            "ArabicText": " رَبِّ ابنِ لى عِندَكَ بَيتًا فِى الجَنَّةِ",
            "EngText": "Rabbi ibni lee AAindaka baytan fee aljannati ",
            "EngTranslation": "My Lord! Build for me a home with You in Paradise",
            "Ref": "(66/11)",
            "SurahName": "ٱلتَّحْرِيم"
        },
        {
            "DuaNo": "63",
            "ArabicText": " رَبِّ اغفِر لى وَلِوٰلِدَىَّ وَلِمَن دَخَلَ بَيتِىَ مُؤمِنًا وَلِلمُؤمِنينَ وَالمُؤمِنٰتِ وَلا تَزِدِ الظّٰلِمينَ إِلّا تَبارًا",
            "EngText": "Rabbi ighfir lee waliwalidayya waliman dakhala baytiya muminan walilmumineena waalmuminati wala tazidi alththalimeena illa tabara",
            "EngTranslation": "My Lord! forgive me and my parents and him who enters my house believing,and the believing men and the believing women; and do not increase the unjust in aught but destruction!''",
            "Ref": "(71/28)",
            "SurahName": "نُوح"
        }
    ]
